---
kind: method
id: M:Autodesk.Revit.DB.FabricationService.Dispose
source: html/769b9c47-e567-40a6-514a-f1033d98070f.htm
---
# Autodesk.Revit.DB.FabricationService.Dispose Method

Releases all resources used by the FabricationService

## Syntax (C#)
```csharp
public void Dispose()
```